using System;


// Класс, представляющий файл сборки Minecraft, содержащий информацию о пути, контрольной сумме, размере и связанных версиях сборки
namespace KsevaMine.Domain.Entities
{
    public class BuildFile
    {
        public int Id { get; set; }                         // Первичный ключ файла сборки
        public int VersionId { get; set; }                  // Внешний ключ, указывающий на версию сборки, к которой принадлежит этот файл, используемый для связи файла с конкретной версией сборки Minecraft и отображения информации о версии сборки, связанной с этим файлом
        public string Path { get; set; } = string.Empty;    // Путь к файлу сборки, используемый для хранения информации о расположении файла в файловой системе или URL-адресе, и отображения его пользователям
        public string SHA256 { get; set; } = string.Empty;  // Контрольная сумма SHA-256 файла сборки, используемая для проверки целостности файла и обеспечения его безопасности, а также отображения информации о контрольной сумме пользователям
        public long Size { get; set; }                      // Размер файла сборки в байтах, используемый для отображения информации о размере файла пользователям и обеспечения правильного управления файлами сборки
        public bool Required { get; set; } = true;          // Флаг, указывающий, является ли файл сборки обязательным для загрузки и использования, используемый для отображения информации о необходимости файла пользователям и обеспечения правильного управления файлами сборки
        public bool DeltaAvailable { get; set; }            // Флаг, указывающий, доступна ли дельта-версия файла сборки для оптимизации загрузки и обновлений, используемый для отображения информации о доступности дельта-версии пользователям и обеспечения правильного управления файлами сборки
        public string? BaseVersion { get; set; }            // Версия сборки, от которой была создана дельта-версия файла сборки, используемая для отображения информации о базовой версии сборки пользователям и обеспечения правильного управления файлами сборки при наличии дельта-версии


        // Навигационные свойства для связи с родительской версией сборки
        public BuildVersion Version { get; set; } = null!; // Навигационное свойство для связи с родительской версией сборки, позволяющее получить доступ к информации о версии сборки, к которой принадлежит этот файл, и отображения ее пользователям
    }
}
