using System;


// Класс, представляющий сервер Minecraft, содержащий информацию об адресе, названии, связанных сборках и версиях сборки, а также статусе активности сервера
namespace KsevaMine.Domain.Entities
{
    public class Server
    {
        public int Id { get; set; }                         // Первичный ключ сервера
        public string Address { get; set; } = string.Empty; // Адрес сервера (например, IP-адрес или доменное имя), используемый для подключения к серверу Minecraft
        public string Name { get; set; } = string.Empty;    // Название сервера, отображаемое пользователям, используемое для идентификации сервера и отображения его информации в пользовательском интерфейсе
        public int BuildId { get; set; }                    // Внешний ключ, указывающий на сборку, используемую этим сервером, используемый для связи сервера с конкретной сборкой Minecraft и отображения информации о сборке, связанной с этим сервером
        public int? BuildVersionId { get; set; }            // Внешний ключ, указывающий на конкретную версию сборки, используемую этим сервером, используемый для связи сервера с конкретной версией сборки Minecraft и отображения информации о версии сборки, связанной с этим сервером
        public bool IsActive { get; set; }                  // Статус активности сервера, указывающий, является ли сервер активным и доступным для подключения пользователями, используемый для отображения статуса сервера в пользовательском интерфейсе и фильтрации серверов по статусу активности
        public DateTime CreatedAt { get; set; }             // Дата и время создания сервера, используемые для сортировки и отображения информации о сервере


        // Навигационные свойства для связи с родительской сборкой и версией сборки
        public Build Build { get; set; } = null!;           // Навигационное свойство для связи с родительской сборкой, позволяющее получить доступ к информации о сборке, используемой этим сервером, и отображения ее пользователям
        public BuildVersion? BuildVersion { get; set; }     // Навигационное свойство для связи с конкретной версией сборки, позволяющее получить доступ к информации о версии сборки, используемой этим сервером, и отображения ее пользователям
    }
}
