using System;


// Класс, представляющий конкретную версию сборки Minecraft, содержащую информацию о версии манифеста, изменениях и связанных файлах сборки
namespace KsevaMine.Domain.Entities
{
    public class BuildVersion
    {
        public int Id { get; set; }                                                 // Первичный ключ версии сборки
        public int BuildId { get; set; }                                            // Внешний ключ, указывающий на сборку, к которой принадлежит эта версия
        public int ManifestVersion { get; set; }                                    // Номер версии манифеста, используемый для отслеживания изменений и обновлений в сборке
        public string Changelog { get; set; } = string.Empty;                       // Краткое описание изменений и обновлений, внесенных в эту версию сборки, отображаемое пользователям
        public DateTime CreatedAt { get; set; }                                     // Дата и время создания версии сборки, используемые для сортировки и отображения информации о версии сборки


        // Навигационные свойства для связи с родительской сборкой и файлами сборки
        public Build Build { get; set; } = null!;                                   // Навигационное свойство для связи с родительской сборкой, позволяющее получить доступ к информации о сборке, к которой принадлежит эта версия
        public ICollection<BuildFile> Files { get; set; } = new List<BuildFile>();  // Коллекция файлов сборки, связанных с этой версией сборки, используемая для хранения информации о файлах, входящих в эту версию сборки, и отображения их пользователям
    }
}
